Управление_пожарной_частью_/src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.ОстаткиИмуществаСотрудников</registerRecords>
  <registerRecords>InformationRegister.Списание</registerRecords>
  <attributes>
    <name>ФИОСотрудника</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/InformationRegisters/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Списание</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_пожарной_частью_/src/AccumulationRegisters/ОстаткиИмуществаСотрудников/ОстаткиИмуществаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиИмуществаСотрудников</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/Documents/Списание/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Списание
	Движения.Списание.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество из ВещевоеИмущество Цикл
		Движение = Движения.Списание.Добавить();
		Движение.ДатаСписания = Дата; 
		Движение.Сотрудник = ФИОСотрудника;
		Движение.Наименование = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Причина = ТекСтрокаВещевоеИмущество.Причина;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;
	
	Движения.ОстаткиИмуществаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество Из ВещевоеИмущество Цикл
		Движение = Движения.ОстаткиИмуществаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ФИОСотрудника;
		Движение.Наименование = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла; 
	Если ФИОСотрудника = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Сотрудник = ФИОСотрудника.ПолучитьОбъект();
    
    Для Каждого СтрокаДок Из ВещевоеИмущество Цикл
        Для Каждого СтрокаСотрудника Из Сотрудник.ВещевоеИмущество Цикл
            Если СтрокаСотрудника.Наименование = СтрокаДок.Наименование Тогда
                Сотрудник.ВещевоеИмущество.Удалить(СтрокаСотрудника);
                Прервать;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
    Сотрудник.Записать();   
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры;
